import 'package:get/get.dart';

class WorldLanguage extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {

    'en_US': {
      'Создать аккаунт': 'Sign In',
      'Войти': 'Log In',
      'Проблемы со входом в аккаунт?': 'Having troubles with logging in?',
      'Войти в аккаунт': 'Log In To Account',
      'Введите телефон или почту': 'Enter phone number or email',
      'Введите пароль': 'Enter password',
      'Продолжить': 'Continue',
      'Введите номер телефона:': 'Enter your phone number:',
      'Ваш номер телефона будет использоваться для входа в аккаунт': 'Your phone number will be used to login into account',
      'Подтвердите номер': 'Confirm your phone number',
      'Мы отправили вам SMS с кодом на номер': 'We’ve sent you an SMS with a code to the number',
    },

    'kz_KZ': {
      'Создать аккаунт': 'Тіркелу',
      'Войти': 'Кіру',
      'Проблемы со входом в аккаунт?': 'Кірумен мәселелер пайда болды ма?',
      'Войти в аккаунт': 'Аккаунтыңызға кіріңіз',
      'Введите телефон или почту': 'Ұялы телефон нөмеріңізді немесе поштаңызды жазыңыз',
      'Введите пароль': 'Құпиясөзді жазыңыз',
      'Продолжить': 'Жалғастыру',
      'Введите номер телефона:': 'Ұялы телефон нөмеріңізді жазыңыз:',
      'Ваш номер телефона будет использоваться для входа в аккаунт': 'Cіздің ұялы телефон нөмеріңіз тіркелу үшін пайдаланылатын болады',
      'Подтвердите номер': 'Нөмеріңізді растаңыз',
      'Мы отправили вам SMS с кодом на номер': 'Біз сіздің нөміріңізге коды бар SMS жібердік'
    },

    'ru_RU':{
      'Создать аккаунт':'Создать аккаунт',
      'Войти':'Войти',
      'Проблемы со входом в аккаунт?': 'Проблемы со входом в аккаунт?',
      'Войти в аккаунт': 'Войти в аккаунт',
      'Введите телефон или почту': 'Введите телефон или почту',
      'Введите пароль': 'Введите пароль',
      'Продолжить': 'Продолжить',
      'Введите номер телефона:': 'Введите номер телефона:',
      'Ваш номер телефона будет использоваться для входа в аккаунт': 'Ваш номер телефона будет использоваться для входа в аккаунт',
      'Подтвердите номер' : 'Подтвердите номер',
      'Мы отправили вам SMS с кодом на номер': 'Мы отправили вам SMS с кодом на номер',
    }

    //add more language here
  };
}